# 1.4[8]. Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками 
# (то есть разломить шоколадку на два прямоугольника).
# Примеры/Тесты:
# 3 2 4 -> yes
# 3 2 1 -> no

# n = int (input('Введите количество долек по ширине, n = '))
# m = int (input('Введите количество долек по длине, m = '))
# k = int (input('Введите количество отломленных долек, k = '))

# print('yes' if n == round (k / 2) or m == round(k / 2) else 'no')

