# №2.1[9]. По данному целому неотрицательному n вычислите значение n!. 
# N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1 
# Решить задачу используя цикл while
# Примеры/Тесты:
# 5 -> Факториал 5 равен 120
# 0 -> Факториал 0 равен 1

# N = int(input ("Введите целое неотрицательное число N = ", ))
# N_factorial = 1

# # while N != 0:
# #     N_factorial *= N 
# #     N -= 1

# # print (f"N! = ", N_factorial)


N = int(input ("Введите целое неотрицательное число N = ", ))
N_factorial = 1

if N == 0 or N == 1:
    print (f"N! = ", 1)
else:
    for i in range (2, N+1):
        N_factorial *= i
        i += 1
    print (f"N! = ", N_factorial)
